---
kind: method
id: M:Autodesk.Revit.DB.FailureMessageAccessor.GetDefaultResolutionCaption
source: html/b66d3508-c6d2-94c9-b89d-91105247e745.htm
---
# Autodesk.Revit.DB.FailureMessageAccessor.GetDefaultResolutionCaption Method

Retrieves the caption of default resolution of the failure.

## Syntax (C#)
```csharp
public string GetDefaultResolutionCaption()
```

## Returns
The caption of default resolution of the failure.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - This FailureMessageAccessor has not been properly initialized.